### DataFrames
Collection of series is knows as DataFrames

In [4]:
import numpy as np
import pandas as pd

### Creating a DataFrame

In [5]:
data = {
    'Name':['John','Anna','Peter','Linda'],
    'Age':[28,34,29,42],
    'City':['New York','Paris','Berlin','London'],
    'Salary':[65000,70000,62000,85000]
}

In [6]:
df = pd.DataFrame(data)
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [7]:
data_list = [
    ['John',28,'New York',65000],
    ['Anna',34,'Paris',70000],
    ['Peter',29,'Berlin',62000],
]
df2 = pd.DataFrame(data_list)
columns = ['Name','Age','City','Salary']
df2 = pd.DataFrame(data_list,columns=columns)

In [8]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000

### Selection and indexing of Columns

In [9]:
df2['Name']

0     John
1     Anna
2    Peter
Name: Name, dtype: object

In [10]:
df2[['Name','City']]

    Name      City
0   John  New York
1   Anna     Paris
2  Peter    Berlin

### Creating a new column

In [25]:
df2['expInYears'] = [5,7,9]

In [26]:
df2

    Name  Age  expInYears
0   John   28           5
1   Anna   34           7
2  Peter   29           9

### Removing column

In [27]:
df2.drop("expInYears",axis=1,inplace=True)

In [28]:
print(df2)

    Name  Age
0   John   28
1   Anna   34
2  Peter   29

In [29]:
df2.drop(["Name","Age"],axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2]

### Selecting a row

In [30]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [31]:
df.loc[1]

Name       Anna
Age          34
City      Paris
Salary    70000
Name: 1, dtype: object

In [32]:
df.loc[[0,1]]

   Name  Age      City  Salary
0  John   28  New York   65000
1  Anna   34     Paris   70000

In [33]:
df.iloc[3]

Name       Linda
Age           42
City      London
Salary     85000
Name: 3, dtype: object

### Subsets of rows and column

In [36]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [37]:
df.loc[[0,1]][["City","Salary"]]

       City  Salary
0  New York   65000
1     Paris   70000

### Conditional Selection

In [39]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [40]:
df[df["Age"]>30]

    Name  Age    City  Salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

In [42]:
df[(df["Age"]>30) & (df["City"] == "Paris")]

   Name  Age   City  Salary
1  Anna   34  Paris   70000